{
  "home": "Home",
  "about_me": "About me",
  "skills": "Skills",
  "projects": "Projects",
  "experience": "Experience",
  "certificates": "Certificates",
  "contact": "Contact",
  "home_1": "Hi, my",
  "home_2": "name is",
  "home_3": "I'm a",
  "home_4": "software developer",
  "home_5": "from Brazil",
  "about_me_paragraph_1": "I have been dedicated to software development since 2022, and since 2023, I have been working professionally as a full-stack developer, focusing on Internet of Things (IoT) solutions. My main stack includes React, TypeScript, Next.js, and Node.js.",
  "about_me_paragraph_2": "My journey began with studies in frontend development, which quickly led me to a position as a Junior Developer. In pursuit of continuous learning, I expanded my knowledge to full-stack application development. I am also experienced with IoT, Ubidots, MQTT, Figma, Tailwind, Sass, and more. I have a particular interest in transforming ideas and business rules into real solutions, applying clean architecture, Domain-Driven Design (DDD), and the Ports and Adapters pattern.",
  "about_me_paragraph_3": "In addition to being a developer, I am a musician, teacher, and have experience in digital marketing. You might also want to check out my YouTube channel.",
  "next_js_description": "Next.js is a React framework that provides hybrid rendering (SSR and SSG), static page generation, simplified routing, integrated API, and performance optimization. It's ideal for building fast, scalable web applications with a focus on SEO, combining efficiency and flexibility in development.",
  "react_js_description": "JavaScript library for building reactive, scalable user interfaces with a focus on reusable components.",
  "typescript_description": "A superset of JavaScript that adds static typing, improving safety and productivity in development.",
  "node_js_description": "JavaScript runtime for backend development, enabling scalable, high-performance applications with an event-driven focus.",
  "tailwind_css_description": "Utility-first CSS framework that simplifies interface design with ready-to-use and customizable classes.",
  "styled_components_description": "Styling library for React and React Native that uses CSS-in-JS, combining styles with components.",
  "sass_description": "CSS preprocessor offering advanced features like variables, mixins, and rule nesting.",
  "postgresql_description": "Advanced relational database, highly scalable and reliable, with support for extensions and complex transactions.",
  "ubidots_description": "IoT platform for real-time data monitoring and visualization, simplifying connected device management.",
  "html_css_js_description": "HTML, CSS, and JavaScript form the foundation of web development. HTML structures content, CSS defines style and layout, and JavaScript adds interactivity, creating dynamic and engaging user experiences.",
  "see_more": "See more",
  "see_less": "See less",
  "experience_sagil": "Sagil is a native IoT (Internet of Things) technology brand created as part of the innovation program at Gnatus, a leader in the dental market. The company focuses on monitoring and ensuring the safety of temperature-sensitive products in the dental, hospital, pharmaceutical, and veterinary sectors. I participated in the development of the solution from the ground up, contributing to every stage—from data collection through sensors to the development of the final platform.",
  "repository": "Repository",
  "production": "Production",
  "project_status_in_progress": "In progress",
  "project_status_finished": "Finished",
  "project_portfolio__title": "My Porfolio",
  "project_portfolio__description": "Designed to serve as a showcase of my journey, skills, and professional achievements through a simple and elegant interface."
}
