{
  "home": "Início",
  "about_me": "Sobre mim",
  "skills": "Habilidades",
  "projects": "Projetos",
  "experience": "Experiência",
  "certificates": "Certificados",
  "contact": "Contato",
  "home_1": "Olá, meu",
  "home_2": "nome é",
  "home_3": "Eu sou",
  "home_4": "desenvolvedor de software",
  "about_me_paragraph_1": "Me dedico à área de desenvolvimento de software desde 2022, e desde 2023 atuo profissionalmente como desenvolvedor full-stack, com foco em soluções de Internet das Coisas (IoT). Minha stack principal inclui React, TypeScript, Next.js e Node.js.",
  "about_me_paragraph_2": "Minha trajetória começou com estudos em frontend, o que me levou rapidamente a uma posição como Desenvolvedor Júnior. Em busca de aprendizado constante, expandi meus conhecimentos para o desenvolvimento de aplicações full-stack. Também tenho conhecimentos em IoT, Ubidots, MQTT, Figma, Tailwind, Sass etc. Tenho especial interesse em transformar ideias e regras de negócio em soluções reais, aplicando arquitetura limpa, Domain-Driven Design (DDD) e o padrão Ports and Adapters.",
  "about_me_paragraph_3": "Além de programador, sou músico, professor e tenho experiência em marketing digital. Talvez você possa aproveitar para conhecer meu canal no Youtube também.",
  "next_js_description": "Next.js é um framework React que oferece renderização híbrida (SSR e SSG), geração de páginas estáticas, roteamento simplificado, API integrada e otimização de desempenho. Ideal para criar aplicações web rápidas, escaláveis e com foco em SEO, unindo eficiência e flexibilidade no desenvolvimento.",
  "react_js_description": "Biblioteca JavaScript para criar interfaces de usuário reativas e escaláveis, com foco em componentes reutilizáveis.",
  "typescript_description": "Superset do JavaScript que adiciona tipagem estática, aumentando a segurança e a produtividade no desenvolvimento.",
  "node_js_description": "Runtime JavaScript para backend, permitindo construir aplicações escaláveis e de alta performance com foco em eventos.",
  "tailwind_css_description": "Framework CSS utilitário que facilita o design de interfaces com classes prontas e personalizáveis.",
  "styled_components_description": "Biblioteca para estilização em React e React Native que utiliza CSS-in-JS, unindo estilos e componentes.",
  "sass_description": "Pré-processador CSS que oferece recursos avançados como variáveis, mixins e aninhamento de regras.",
  "postgresql_description": "Banco de dados relacional avançado, altamente escalável e confiável, com suporte a extensões e transações complexas.",
  "ubidots_description": "Plataforma IoT para monitoramento e visualização de dados em tempo real, facilitando a gestão de dispositivos conectados.",
  "html_css_js_description": "HTML, CSS e JavaScript formam a base do desenvolvimento web. HTML estrutura o conteúdo, CSS define o estilo e o layout, enquanto JavaScript adiciona interatividade, criando experiências dinâmicas e envolventes para os usuários.",
  "see_more": "Ver mais",
  "see_less": "Ver menos",
  "experience_sagil": "Sagil é uma marca nativa de tecnologia de IoT (Internet das Coisas) criada a partir do programa de inovação da Gnatus, líder no mercado de odontologia. A empresa foca no monitoramento e na segurança de produtos sensíveis à temperatura nos setores odontológico, hospitalar, farmacêutico e veterinário. Participei do desenvolvimento da solução desde o início, atuando em todas as etapas, desde a coleta de dados por meio dos sensores até a construção da plataforma final.",
  "repository": "Repositório",
  "production": "Produção",
  "project_status_in_progress": "Em desenvolvimento",
  "project_status_finished": "Finalizado",
  "project_portfolio__title": "Meu Portfólio",
  "project_portfolio__description": "Desenvolvido para servir como uma vitrine da minha trajetória, habilidades e conquistas profissionais através de uma interface simples e elegante."
}
